IDEA Open Model
BeamDataEc2.IsYDirectionData Property
Compatible with IDEA StatiCa Beta 20.0
 true for deflection data in Y direction
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public bool IsYDirectionData { get; set; }
Public Property IsYDirectionData As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace